In [ ]:
# Tips and Tricks Python Pandas

#01 Menyertakan Prefix & Suffix pada seluruh kolom data frame

In [1]:
# Import Modules nya dahulu

import pandas as pd
import numpy as np

print(pd.__version__) # ini untuk print version dari pandas nya
print(np.__version__) # ini untuk print version dari numpy nya

1.3.3
1.21.2

In [11]:
# Persiapan Data Frame

n_rows = 5 # baris
n_cols = 4 # kolom
cols = tuple('ABCD')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)
df

   A  B  C  D
0  3  4  6  7
1  7  7  7  9
2  8  1  1  6
3  7  8  5  6
4  8  4  8  3

In [3]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [12]:
# Menyertakan Prefix kolom

# prefix menambahkan dari depan

df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D
0        3        4        6        7
1        7        7        7        9
2        8        1        1        6
3        7        8        5        6
4        8        4        8        3

In [13]:
# Menyertakan Suffix kolom

# suffix menambahkan untuk di belakang

df.add_suffix('_field')

   A_field  B_field  C_field  D_field
0        3        4        6        7
1        7        7        7        9
2        8        1        1        6
3        7        8        5        6
4        8        4        8        3

In [ ]:
#02 Rows selection pada data frame

In [2]:
#Import modules
import pandas as pd
import numpy as np

In [6]:
# Persiapan data frame
n_rows = 8 # baris
n_cols = 5 # kolum
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  2  4  3  3  4
1  2  4  3  1  2
2  2  3  2  3  3
3  2  2  1  3  4
4  3  1  2  4  2

In [10]:
# Selection dengan operator logika

df[(df['B'] == 1) | (df['B'] == 3)]

   A  B  C  D  E
2  2  3  2  3  3
4  3  1  2  4  2

In [11]:
# Selection dengan fungsi isin()

df[df['A'].isin([1, 3])]

# kalau pakai not tidak bisa
# df[not df['A'].isin([1, 3])]

   A  B  C  D  E
4  3  1  2  4  2

In [12]:
# Mengenal operator negasi ~
# memunculkan object kecuali dari yang di dalam [' ']

df[~df['A'].isin([1,3])]

   A  B  C  D  E
0  2  4  3  3  4
1  2  4  3  1  2
2  2  3  2  3  3
3  2  2  1  3  4

In [ ]:
#03 Konversi Tipe data string -> numerik pada kolom data frame

In [27]:
# import module
import pandas as pd

In [28]:
# Persiapan data frame

data = {'col1':['1','2','3','4'],
        'col2':['1','2','3','text']}
df= pd.DataFrame(data)
df

  col1  col2
0    1     1
1    2     2
2    3     3
3    4  text

In [29]:
df.dtypes

col1    object
col2    object
dtype: object

In [32]:
# Konversi tipe data dengan fungsi astype()
# Pakai float, integer bisa
df_x = df.astype({'col1':'float'})
df_x

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   4.0  text

In [38]:
df_x.dtypes

col1    float64
col2     object
dtype: object

In [39]:
# Konversi tipe data numerik dengan fungsi to_numeric()
""" Coerce -> ada data dalam proses konversi tipe data ke numerik yang tidak 
dapat dikonversikan ke numerik, maka akan dijadikan NaN (not a number) """

df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3     4   NaN

In [ ]:
#04 Columns selection pada data frame berdasarkan tipe data

In [45]:
# Import modules
import pandas as pd
import numpy as np

In [51]:
n_baris = 6
n_kolom = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_baris, n_kolom)),
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_baris, freq='H')
df = df.reset_index()

df['text'] = list('ABCDEF')

df

                index  bil_pecahan  bil_bulat text
0 2000-01-01 00:00:00          7.0          1    A
1 2000-01-01 01:00:00          6.0          4    B
2 2000-01-01 02:00:00          9.0         10    C
3 2000-01-01 03:00:00         12.0         14    D
4 2000-01-01 04:00:00         12.0         10    E
5 2000-01-01 05:00:00         17.0          1    F

In [52]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
text                   object
dtype: object

In [ ]:
# Memilih kolom bertipe data numerik

In [53]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          7.0          1
1          6.0          4
2          9.0         10
3         12.0         14
4         12.0         10
5         17.0          1

In [54]:
df.select_dtypes(include='float')

   bil_pecahan
0          7.0
1          6.0
2          9.0
3         12.0
4         12.0
5         17.0

In [55]:
df.select_dtypes(include='int')

   bil_bulat
0          1
1          4
2         10
3         14
4         10
5          1

In [56]:
# Memilih kolom bertipe data string / object

df.select_dtypes(include='object')

  text
0    A
1    B
2    C
3    D
4    E
5    F

In [57]:
# Memilih kolom bertipe data datetime

df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00
5 2000-01-01 05:00:00

In [60]:
# Memilih kolom dengan kombinasi tipe data

df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat text
0          7.0          1    A
1          6.0          4    B
2          9.0         10    C
3         12.0         14    D
4         12.0         10    E
5         17.0          1    F